Revit 2024 API
EditorInteraction Constructor
 Construct a default interaction.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public EditorInteraction()
Visual Basic
Public Sub New
Visual C++
public:
EditorInteraction()
See Also
EditorInteraction Class
EditorInteraction Overload
Autodesk.Revit.UI Namespace